SparrowTheNerd/SparkFun-UBlox-STM32/src/u-blox_structs.h
      uint32_t useAOP : 1;

      uint32_t status : 1;
    } bits;
  } moduleQueried;
} UBX_NAV_AOPSTATUS_moduleQueried_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_AOPSTATUS_data_t data;
  UBX_NAV_AOPSTATUS_moduleQueried_t moduleQueried;
  void (*callbackPointerPtr)(UBX_NAV_AOPSTATUS_data_t *);
  UBX_NAV_AOPSTATUS_data_t *callbackData;
} UBX_NAV_AOPSTATUS_t;

// UBX-NAV-EOE (0x01 0x61): End of Epoch
const uint16_t UBX_NAV_EOE_LEN = 4;

typedef struct
{
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
} UBX_NAV_EOE_data_t;

typedef struct
{
  union
  {
    uint32_t all;
    struct
    {
      uint32_t all : 1;

      uint32_t iTOW : 1;
    } bits;
  } moduleQueried;
} UBX_NAV_EOE_moduleQueried_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_NAV_EOE_data_t data;
  UBX_NAV_EOE_moduleQueried_t moduleQueried;
  void (*callbackPointerPtr)(UBX_NAV_EOE_data_t *);
  UBX_NAV_EOE_data_t *callbackData;
} UBX_NAV_EOE_t;

// RXM-specific structs

// UBX-RXM-SFRBX (0x02 0x13): Broadcast navigation data subframe
// Note: SFRBX is output-only. Polling is not possible
// Note: length is variable
// Note: on protocol version 17: numWords is (0..16)
//       on protocol version 18+: numWords is (0..10)
#define UBX_RXM_SFRBX_CALLBACK_BUFFERS 14 // 14 data buffers, 14 message buffers, 3 flags, in uint32_t
const uint8_t UBX_RXM_SFRBX_MAX_WORDS = 16;
const uint16_t UBX_RXM_SFRBX_MAX_LEN = 8 + (4 * UBX_RXM_SFRBX_MAX_WORDS);

typedef struct
{
  uint8_t gnssId; // GNSS identifier
  uint8_t svId;   // Satellite identifier
  uint8_t reserved1;
  uint8_t freqId;   // GLONASS frequency slot
  uint8_t numWords; // The number of data words contained in this message (0..16)
  uint8_t chn;      // The tracking channel number the message was received on
  uint8_t version;  // Message version (0x01 for this version)
  uint8_t reserved2;
  uint32_t dwrd[UBX_RXM_SFRBX_MAX_WORDS]; // The data words
} UBX_RXM_SFRBX_data_t;

// Define a struct to hold the entire SFRBX message so the whole thing can be pushed to the PointPerfect Library
// Remember that the length of the payload will be variable.
typedef struct
{
  uint8_t sync1; // 0xB5
  uint8_t sync2; // 0x62
  uint8_t cls;
  uint8_t ID;
  uint8_t lengthLSB;
  uint8_t lengthMSB;
  uint8_t payload[UBX_RXM_SFRBX_MAX_LEN];
  uint8_t checksumA;
  uint8_t checksumB;
} UBX_RXM_SFRBX_message_data_t;

struct ubxSFRBXAutomaticFlags
{
  union
  {
    uint32_t all;
    struct
    {
      uint32_t automatic : 1;                                             // Will this message be delivered and parsed "automatically" (without polling)
      uint32_t implicitUpdate : 1;                                        // Is the update triggered by accessing stale data (=true) or by a call to checkUblox (=false)
      uint32_t addToFileBuffer : 1;                                       // Should the raw UBX data be added to the file buffer?
      uint32_t callbackCopyValid : UBX_RXM_SFRBX_CALLBACK_BUFFERS;        // Are the copies of the data struct used by the callback valid/fresh?
      uint32_t callbackMessageCopyValid : UBX_RXM_SFRBX_CALLBACK_BUFFERS; // Are the copies of the data structs used by the callback valid/fresh?
    } bits;
  } flags;
};

typedef struct
{
  ubxSFRBXAutomaticFlags automaticFlags;
  UBX_RXM_SFRBX_data_t data;
  bool moduleQueried;
  void (*callbackPointerPtr)(UBX_RXM_SFRBX_data_t *);
  UBX_RXM_SFRBX_data_t *callbackData; // This is an array of buffers
  void (*callbackMessagePointerPtr)(UBX_RXM_SFRBX_message_data_t *);
  UBX_RXM_SFRBX_message_data_t *callbackMessageData; // This is an array of buffers
} UBX_RXM_SFRBX_t;

// UBX-RXM-MEASX (0x02 0x14): Receiver Manager Messages: i.e. Satellite Status, RTC Status.
const uint8_t UBX_RXM_MEASX_MAX_BLOCKS = 92;
const uint16_t UBX_RXM_MEASX_MAX_LEN = 44 + (24 * UBX_RXM_MEASX_MAX_BLOCKS);

typedef struct
{
  uint8_t version; // Message version (0x01 for this version)
  uint8_t reserved1[3];
  uint32_t gpsTOW;
  uint32_t gloTOW;
  uint32_t bdsTOW;
  uint8_t reserved2[4];
  uint32_t qzssTOW;
  uint16_t gpsTOWacc;
  uint16_t gloTOWacc;
  uint16_t bdsTOWacc;
  uint8_t reserved3[2];
  uint16_t qzssTOWacc;
  uint8_t numSV;
  union
  {
    uint8_t all;
    struct
    {
      uint8_t towSet : 2; // TOW set (0 = no, 1 or 2 = yes)
    } bits;
  } flags;
  uint8_t reserved4[8];
} UBX_RXM_MEASX_header_t;

typedef struct
{
  uint8_t gnssId;
  uint8_t svId;
  uint8_t cNo;
  uint8_t mpathIndic;
  int32_t dopplerMS;
  int32_t dopplerHz;
  uint16_t wholeChips;
  uint16_t fracChips;
  uint32_t codePhase;
  uint8_t intCodePhase;
  uint8_t pseuRangeRMSErr;
  uint8_t reserved5[2];
} UBX_RXM_MEASX_block_t;

typedef struct
{
  UBX_RXM_MEASX_header_t header;
  UBX_RXM_MEASX_block_t blocks[UBX_RXM_MEASX_MAX_BLOCKS];
} UBX_RXM_MEASX_data_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_RXM_MEASX_data_t data;
  bool moduleQueried;
  void (*callbackPointerPtr)(UBX_RXM_MEASX_data_t *);
  UBX_RXM_MEASX_data_t *callbackData;
} UBX_RXM_MEASX_t;

// UBX-RXM-RAWX (0x02 0x15): Multi-GNSS raw measurement data
// Note: length is variable
const uint8_t UBX_RXM_RAWX_MAX_BLOCKS = 92; // See issue #70 and PR #74 for more info
const uint16_t UBX_RXM_RAWX_MAX_LEN = 16 + (32 * UBX_RXM_RAWX_MAX_BLOCKS);

typedef struct
{
  uint8_t rcvTow[8]; // Measurement time of week in receiver local time [64-bit float]
  uint16_t week;     // GPS week number
  int8_t leapS;      // GPS leap seconds
  uint8_t numMeas;   // Number of measurements to follow
  union
  {
    uint8_t all;
    struct
    {
      uint8_t leapSec : 1;  // Leap seconds have been determined
      uint8_t clkReset : 1; // Clock reset applied
    } bits;
  } recStat;
  uint8_t version; // Message version (0x01 for this version)
  uint8_t reserved1[2];
} UBX_RXM_RAWX_header_t;

typedef struct
{
  uint8_t prMes[8];  // Pseudorange measurement: m [64-bit float]
  uint8_t cpMes[8];  // Carrier phase measurement: cycles [64-bit float]
  uint8_t doMes[4];  // Doppler measurement: Hz [32-bit float]
  uint8_t gnssId;    // GNSS identifier
  uint8_t svId;      // Satellite identifier
  uint8_t sigId;     // New signal identifier
  uint8_t freqId;    // GLONASS frequency slot
  uint16_t lockTime; // Carrier phase locktime counter: ms
  uint8_t cno;       // Carrier-to-noise density ratio: dB-Hz
  uint8_t prStdev;   // Estimated pseudorange measurement standard deviation: m * 0.01 * 2^n [4-bit]
  uint8_t cpStdev;   // Estimated carrier phase measurement standard deviation: cycles * 0.004 [4-bit]
  uint8_t doStdev;   // Estimated Doppler measurement standard deviation: Hz * 0.002 * 2^n [4-bit]
  union
  {
    uint8_t all;
    struct
    {
      uint8_t prValid : 1;    // Pseudorange valid
      uint8_t cpValid : 1;    // Carrier phase valid
      uint8_t halfCyc : 1;    // Half cycle valid
      uint8_t subHalfCyc : 1; // Half cycle subtracted from phase
    } bits;
  } trkStat;
  uint8_t reserved2;
} UBX_RXM_RAWX_block_t;

typedef struct
{
  UBX_RXM_RAWX_header_t header;
  UBX_RXM_RAWX_block_t blocks[UBX_RXM_RAWX_MAX_BLOCKS];
} UBX_RXM_RAWX_data_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_RXM_RAWX_data_t data;
  bool moduleQueried;
  void (*callbackPointerPtr)(UBX_RXM_RAWX_data_t *);
  UBX_RXM_RAWX_data_t *callbackData;
} UBX_RXM_RAWX_t;

// UBX-RXM-COR (0x02 0x34): Differential correction input status
const uint16_t UBX_RXM_COR_LEN = 12;

typedef struct
{
  uint8_t version;      // Message version (0x01 for this version)
  uint8_t ebno;         // Energy per bit to noise power spectral density ratio (Eb/N0): 2^-3 dB
                        // 0: unknown. Reported only for protocol UBX-RXM-PMP (SPARTN) to monitor signal quality.
  uint8_t reserved0[2]; // Reserved
  union
  {
    uint32_t all;
    struct
    {
      uint32_t protocol : 5;        // Input correction data protocol:
                                    // 0: Unknown
                                    // 1: RTCM3
                                    // 2: SPARTN (Secure Position Augmentation for Real Time Navigation)
                                    // 29: UBX-RXM-PMP (SPARTN)
                                    // 30: UBX-RXM-QZSSL6
      uint32_t errStatus : 2;       // Error status of the received correction message content based on possibly available error codes or checksums:
                                    // 0: Unknown
                                    // 1: Error-free
                                    // 2: Erroneous
      uint32_t msgUsed : 2;         // Status of receiver using the input message:
                                    // 0: Unknown
                                    // 1: Not used
                                    // 2: Used
      uint32_t correctionId : 16;   // Identifier for the correction stream:
                                    // For RTCM 3: Reference station ID (DF003) of the received RTCM input message.
                                    // Valid range 0-4095.
                                    // For all other messages, reports 0xFFFF.
                                    // For other correction protocols 0xFFFF.
      uint32_t msgTypeValid : 1;    // Validity of the msgType field. Set to False e.g. if the protocol does not define msgType.
      uint32_t msgSubTypeValid : 1; // Validity of the msgSubType field. Set to False e.g. if the protocol does not define subtype for the msgType.
      uint32_t msgInputHandle : 1;  // Input handling support of the input message:
                                    // 0: Receiver does not have input handling support for this message
                                    // 1: Receiver has input handling support for this message
      uint32_t msgEncrypted : 2;    // Encryption status of the input message:
                                    // 0: Unknown
                                    // 1: Not encrypted
                                    // 2: Encrypted
      uint32_t msgDecrypted : 2;    // Decryption status of the input message:
                                    // 0: Unknown
                                    // 1: Not decrypted
                                    // 2: Successfully decrypted
    } bits;
  } statusInfo;
  uint16_t msgType;    // Message type
  uint16_t msgSubType; // Message subtype
} UBX_RXM_COR_data_t;

// The COR data can only be accessed via a callback. COR cannot be polled.
typedef struct
{
  ubxAutomaticFlags automaticFlags;
  void (*callbackPointerPtr)(UBX_RXM_COR_data_t *);
  UBX_RXM_COR_data_t *callbackData;
} UBX_RXM_COR_t;

// UBX-RXM-PMP (0x02 0x72): PMP raw data (D9 modules)
// There are two versions of this message but, fortunately, both have a max len of 528
const uint16_t UBX_RXM_PMP_MAX_USER_DATA = 504;
const uint16_t UBX_RXM_PMP_MAX_LEN = UBX_RXM_PMP_MAX_USER_DATA + 24;

typedef struct
{
  uint8_t version;             // Message version (0x00 / 0x01)
  uint8_t reserved0;           // Reserved
  uint16_t numBytesUserData;   // version 0x00: reserved0 ; version 0x01: Number of bytes the userData block has in this frame (0...504)
  uint32_t timeTag;            // Time since startup when frame started : ms
  uint32_t uniqueWord[2];      // Received unique words
  uint16_t serviceIdentifier;  // Received service identifier
  uint8_t spare;               // Received spare data
  uint8_t uniqueWordBitErrors; // Number of bit errors in both unique words

