SparrowTheNerd/SparkFun-UBlox-STM32/src/u-blox_structs.h
      uint32_t towMS : 1;
      uint32_t towSubMS : 1;
      uint32_t qErr : 1;
      uint32_t week : 1;

      uint32_t timeBase : 1;
      uint32_t utc : 1;
      uint32_t raim : 1;
      uint32_t qErrInvalid : 1;

      uint32_t timeRefGnss : 1;
      uint32_t utcStandard : 1;
    } bits;
  } moduleQueried;
} UBX_TIM_TP_moduleQueried_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_TIM_TP_data_t data;
  UBX_TIM_TP_moduleQueried_t moduleQueried;
  void (*callbackPointerPtr)(UBX_TIM_TP_data_t *);
  UBX_TIM_TP_data_t *callbackData;
} UBX_TIM_TP_t;

// SEC-specific structs

// UBX-SEC-SIG (0x27 0x09): Signal security information
// Note: there are two versions of UBX-SEC-SIG.
//   Version 1 is 12 bytes.
//   Version 2 is variable.
//   Check the version byte before attempting to read data from the struct
const uint16_t UBX_SEC_SIG_LEN_VERSION1 = 12;
const uint16_t UBX_SEC_SEG_MAX_CENT_FREQ_VERSION2 = 6; // ZED seems to default to 6 frequencies - without jamming
const uint16_t UBX_SEC_SIG_MAX_LEN_VERSION2 = 4 + (4 * UBX_SEC_SEG_MAX_CENT_FREQ_VERSION2);

typedef struct
{
  uint8_t version; // Message version (0x01 for this version)
  union
  {
    struct
    {
      uint8_t reserved0[3];
      union
      {
        uint8_t all;
        struct
        {
          uint8_t jamDetEnabled : 1; // Flag indicates whether jamming/interference detection is enabled
          uint8_t jammingState : 2;  // Jamming/interference state:
                                     // 0: Unknown, 1: No jamming indicated
                                     // 2: Warning; jamming indicated but fix OK
                                     // 3: Critical; jamming indicated and no fix
        } bits;
      } jamFlags;
      uint8_t reserved1[3];
      union
      {
        uint8_t all;
        struct
        {
          uint8_t spfDetEnabled : 1; // Flag indicates whether spoofing detection is enabled
          uint8_t spoofingState : 3; // Spoofing state:
                                     // 0: Unknown, 1: No spoofing indicated
                                     // 2: Spoofing indicated, 3: Spoofing affirmed
        } bits;
      } spfFlags;
      uint8_t reserved2[3];
    } version1;
    struct {
      union
      {
        uint8_t all;
        struct
        {
          uint8_t jamDetEnabled : 1; // Flag indicates whether jamming/interference detection is enabled
          uint8_t jamState : 2;      // Jamming/interference state:
                                     // 0: Unknown, 1: No jamming indicated
                                     // 2: Warning; jamming indicated but fix OK
          uint8_t spfDetEnabled : 1; // Flag indicates whether spoofing detection is enabled
          uint8_t spfState : 3;      // Spoofing state:
                                     // 0: Unknown, 1: No spoofing indicated
                                     // 2: Spoofing indicated, 3: Spoofing affirmed
        } bits;
      } sigSecFlags;
      uint8_t reserved0;
      uint8_t jamNumCentFreqs; // The number of center frequencies provided
      union
      {
        uint32_t all;
        struct
        {
          uint32_t centFreq : 24; // Center frequency in [kHz], floored to the nearest kHz multiple
          uint32_t jammed : 1; // Flag indicates whether signals on the given center frequency are considered jammed
        } bits;
      } jamStateCentFreq[UBX_SEC_SEG_MAX_CENT_FREQ_VERSION2];
    } version2;
  } versions;
} UBX_SEC_SIG_data_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_SEC_SIG_data_t data;
  bool moduleQueried;
  void (*callbackPointerPtr)(UBX_SEC_SIG_data_t *);
  UBX_SEC_SIG_data_t *callbackData;
} UBX_SEC_SIG_t;

// UBX-SEC-UNIQID (0x27 0x03): Unique chip ID
// The ID is five bytes on the F9 and M9 (version 1) but six bytes on the M10 (version 2)
const uint16_t UBX_SEC_UNIQID_LEN_VERSION1 = 9;
const uint16_t UBX_SEC_UNIQID_LEN_VERSION2 = 10;

typedef struct
{
  uint8_t version;
  uint8_t reserved0[3];
  uint8_t uniqueId[6];
} UBX_SEC_UNIQID_data_t;

// ESF-specific structs

// UBX-ESF-ALG (0x10 0x14): IMU alignment information
const uint16_t UBX_ESF_ALG_LEN = 16;

typedef struct
{
  uint32_t iTOW;   // GPS time of week of the HNR epoch: ms
  uint8_t version; // Message version (0x01 for this version)
  union
  {
    uint8_t all;
    struct
    {
      uint8_t autoMntAlgOn : 1; // Automatic IMU-mount alignment on/off bit
      uint8_t status : 3;       // Status of the IMU-mount alignment
                                //   0: user-defined/fixed angles are used
                                //   1: IMU-mount roll/pitch angles alignment is ongoing
                                //   2: IMU-mount roll/pitch/yaw angles alignment is ongoing
                                //   3: coarse IMU-mount alignment are used
                                //   4: fine IMU-mount alignment are used
    } bits;
  } flags;
  union
  {
    uint8_t all;
    struct
    {
      uint8_t tiltAlgError : 1; // IMU-mount tilt (roll and/or pitch) alignment error (0: no error, 1: error)
      uint8_t yawAlgError : 1;  // IMU-mount yaw alignment error (0: no error, 1: error)
      uint8_t angleError : 1;   // IMU-mount misalignment Euler angle singularity error (0: no error, 1: error)
    } bits;
  } error;
  uint8_t reserved1;
  uint32_t yaw;  // IMU-mount yaw angle [0, 360]: Degrees * 1e-2
  int16_t pitch; // IMU-mount pitch angle [-90, 90]: Degrees * 1e-2
  int16_t roll;  // IMU-mount roll angle [-180, 180]: Degrees * 1e-2
} UBX_ESF_ALG_data_t;

typedef struct
{
  union
  {
    uint32_t all;
    struct
    {
      uint32_t all : 1;

      uint32_t iTOW : 1;
      uint32_t version : 1;

      uint32_t autoMntAlgOn : 1;
      uint32_t status : 1;

      uint32_t tiltAlgError : 1;
      uint32_t yawAlgError : 1;
      uint32_t angleError : 1;

      uint32_t yaw : 1;
      uint32_t pitch : 1;
      uint32_t roll : 1;
    } bits;
  } moduleQueried;
} UBX_ESF_ALG_moduleQueried_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_ESF_ALG_data_t data;
  UBX_ESF_ALG_moduleQueried_t moduleQueried;
  void (*callbackPointerPtr)(UBX_ESF_ALG_data_t *);
  UBX_ESF_ALG_data_t *callbackData;
} UBX_ESF_ALG_t;

// UBX-ESF-INS (0x10 0x15): Vehicle dynamics information
const uint16_t UBX_ESF_INS_LEN = 36;

typedef struct
{
  union
  {
    uint32_t all;
    struct
    {
      uint32_t version : 8;       // Message version (0x01 for this version)
      uint32_t xAngRateValid : 1; // Compensated x-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t yAngRateValid : 1; // Compensated y-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t zAngRateValid : 1; // Compensated z-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t xAccelValid : 1;   // Compensated x-axis acceleration data validity flag (0: not valid, 1: valid)
      uint32_t yAccelValid : 1;   // Compensated y-axis acceleration data validity flag (0: not valid, 1: valid)
      uint32_t zAccelValid : 1;   // Compensated z-axis acceleration data validity flag (0: not valid, 1: valid)
    } bits;
  } bitfield0;
  uint8_t reserved1[4];
  uint32_t iTOW;    // GPS time of week of the HNR epoch: ms
  int32_t xAngRate; // Compensated x-axis angular rate: Degrees/s * 1e-3
  int32_t yAngRate; // Compensated y-axis angular rate: Degrees/s * 1e-3
  int32_t zAngRate; // Compensated z-axis angular rate: Degrees/s * 1e-3
  int32_t xAccel;   // Compensated x-axis acceleration (gravity-free): m/s^2 * 1e-2
  int32_t yAccel;   // Compensated y-axis acceleration (gravity-free): m/s^2 * 1e-2
  int32_t zAccel;   // Compensated z-axis acceleration (gravity-free): m/s^2 * 1e-2
} UBX_ESF_INS_data_t;

typedef struct
{
  union
  {
    uint32_t all;
    struct
    {
      uint32_t all : 1;

      uint32_t version : 1;
      uint32_t xAngRateValid : 1;
      uint32_t yAngRateValid : 1;
      uint32_t zAngRateValid : 1;
      uint32_t xAccelValid : 1;
      uint32_t yAccelValid : 1;
      uint32_t zAccelValid : 1;

      uint32_t iTOW : 1;
      uint32_t xAngRate : 1;
      uint32_t yAngRate : 1;
      uint32_t zAngRate : 1;
      uint32_t xAccel : 1;
      uint32_t yAccel : 1;
      uint32_t zAccel : 1;
    } bits;
  } moduleQueried;
} UBX_ESF_INS_moduleQueried_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_ESF_INS_data_t data;
  UBX_ESF_INS_moduleQueried_t moduleQueried;
  void (*callbackPointerPtr)(UBX_ESF_INS_data_t *);
  UBX_ESF_INS_data_t *callbackData;
} UBX_ESF_INS_t;

