SparrowTheNerd/SparkFun-UBlox-STM32/src/u-blox_structs.h
      uint32_t gpsFixOK : 1;
      uint32_t diffSoln : 1;
      uint32_t WKNSET : 1;
      uint32_t TOWSET : 1;
      uint32_t headVehValid : 1;

      uint32_t lon : 1;
      uint32_t lat : 1;
      uint32_t height : 1;
      uint32_t hMSL : 1;
      uint32_t gSpeed : 1;
      uint32_t speed : 1;
      uint32_t headMot : 1;
      uint32_t headVeh : 1;
      uint32_t hAcc : 1;
      uint32_t vAcc : 1;
      uint32_t sAcc : 1;
      uint32_t headAcc : 1;
    } bits;
  } moduleQueried;
} UBX_HNR_PVT_moduleQueried_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_HNR_PVT_data_t data;
  UBX_HNR_PVT_moduleQueried_t moduleQueried;
  void (*callbackPointerPtr)(UBX_HNR_PVT_data_t *);
  UBX_HNR_PVT_data_t *callbackData;
} UBX_HNR_PVT_t;

// UBX-HNR-ATT (0x28 0x01): Attitude solution
const uint16_t UBX_HNR_ATT_LEN = 32;

typedef struct
{
  uint32_t iTOW; // GPS time of week of the navigation epoch: ms
  uint8_t version;
  uint8_t reserved1[3];
  int32_t roll;        // Vehicle roll: Degrees * 1e-5
  int32_t pitch;       // Vehicle pitch: Degrees * 1e-5
  int32_t heading;     // Vehicle heading: Degrees * 1e-5
  uint32_t accRoll;    // Vehicle roll accuracy: Degrees * 1e-5
  uint32_t accPitch;   // Vehicle pitch accuracy: Degrees * 1e-5
  uint32_t accHeading; // Vehicle heading accuracy: Degrees * 1e-5
} UBX_HNR_ATT_data_t;

typedef struct
{
  union
  {
    uint32_t all;
    struct
    {
      uint32_t all : 1;

      uint32_t iTOW : 1;
      uint32_t version : 1;
      uint32_t roll : 1;
      uint32_t pitch : 1;
      uint32_t heading : 1;
      uint32_t accRoll : 1;
      uint32_t accPitch : 1;
      uint32_t accHeading : 1;
    } bits;
  } moduleQueried;
} UBX_HNR_ATT_moduleQueried_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_HNR_ATT_data_t data;
  UBX_HNR_ATT_moduleQueried_t moduleQueried;
  void (*callbackPointerPtr)(UBX_HNR_ATT_data_t *);
  UBX_HNR_ATT_data_t *callbackData;
} UBX_HNR_ATT_t;

// UBX-HNR-INS (0x28 0x02): Vehicle dynamics information
const uint16_t UBX_HNR_INS_LEN = 36;

typedef struct
{
  union
  {
    uint32_t all;
    struct
    {
      uint32_t version : 8;       // Message version (0x00 for this version)
      uint32_t xAngRateValid : 1; // Compensated x-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t yAngRateValid : 1; // Compensated y-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t zAngRateValid : 1; // Compensated z-axis angular rate data validity flag (0: not valid, 1: valid)
      uint32_t xAccelValid : 1;   // Compensated x-axis acceleration data validity flag (0: not valid, 1: valid)
      uint32_t yAccelValid : 1;   // Compensated y-axis acceleration data validity flag (0: not valid, 1: valid)
      uint32_t zAccelValid : 1;   // Compensated z-axis acceleration data validity flag (0: not valid, 1: valid)
    } bits;
  } bitfield0;
  uint8_t reserved1[4];
  uint32_t iTOW;    // GPS time of week of the HNR epoch: ms
  int32_t xAngRate; // Compensated x-axis angular rate: Degrees/s * 1e-3
  int32_t yAngRate; // Compensated y-axis angular rate: Degrees/s * 1e-3
  int32_t zAngRate; // Compensated z-axis angular rate: Degrees/s * 1e-3
  int32_t xAccel;   // Compensated x-axis acceleration (with gravity): m/s^2 * 1e-2
  int32_t yAccel;   // Compensated y-axis acceleration (with gravity): m/s^2 * 1e-2
  int32_t zAccel;   // Compensated z-axis acceleration (with gravity): m/s^2 * 1e-2
} UBX_HNR_INS_data_t;

typedef struct
{
  union
  {
    uint32_t all;
    struct
    {
      uint32_t all : 1;

      uint32_t version : 1;
      uint32_t xAngRateValid : 1;
      uint32_t yAngRateValid : 1;
      uint32_t zAngRateValid : 1;
      uint32_t xAccelValid : 1;
      uint32_t yAccelValid : 1;
      uint32_t zAccelValid : 1;

      uint32_t iTOW : 1;
      uint32_t xAngRate : 1;
      uint32_t yAngRate : 1;
      uint32_t zAngRate : 1;
      uint32_t xAccel : 1;
      uint32_t yAccel : 1;
      uint32_t zAccel : 1;
    } bits;
  } moduleQueried;
} UBX_HNR_INS_moduleQueried_t;

typedef struct
{
  ubxAutomaticFlags automaticFlags;
  UBX_HNR_INS_data_t data;
  UBX_HNR_INS_moduleQueried_t moduleQueried;
  void (*callbackPointerPtr)(UBX_HNR_INS_data_t *);
  UBX_HNR_INS_data_t *callbackData;
} UBX_HNR_INS_t;

// NMEA-specific structs

// Additional flags and pointers that need to be stored with each message type
struct nmeaAutomaticFlags
{
  union
  {
    uint8_t all;
    struct
    {
      uint8_t completeCopyValid : 1; // Is the copy of the data struct used by the get function valid/fresh? 0 = invalid, 1 = valid
      uint8_t completeCopyRead : 1;  // Has the complete copy been read? 0 = unread, 1 = read
      uint8_t callbackCopyValid : 1; // Is the copy of the data struct used by the callback valid/fresh? 0 = invalid/stale, 1 = valid/fresh
    } bits;
  } flags;
};

// The max length for NMEA messages should be 82 bytes, but GGA messages can exceed that if they include the
// extra decimal places for "High Precision Mode".
//
// To be safe, let's allocate 100 bytes to store the GGA message

const uint8_t NMEA_GGA_MAX_LENGTH = 100;

typedef struct
{
  uint8_t length; // The number of bytes in nmea
  uint8_t nmea[NMEA_GGA_MAX_LENGTH];
} NMEA_GGA_data_t;

typedef struct
{
  nmeaAutomaticFlags automaticFlags;
  NMEA_GGA_data_t workingCopy;  // Incoming data is added to the working copy
  NMEA_GGA_data_t completeCopy; // The working copy is copied into the complete copy when all data has been received and the checksum is valid
  void (*callbackPointerPtr)(NMEA_GGA_data_t *);
  NMEA_GGA_data_t *callbackCopy; // The callback gets its own preserved copy of the complete copy
} NMEA_GPGGA_t;

typedef struct
{
  nmeaAutomaticFlags automaticFlags;
  NMEA_GGA_data_t workingCopy;  // Incoming data is added to the working copy
  NMEA_GGA_data_t completeCopy; // The working copy is copied into the complete copy when all data has been received and the checksum is valid
  void (*callbackPointerPtr)(NMEA_GGA_data_t *);
  NMEA_GGA_data_t *callbackCopy; // The callback gets its own preserved copy of the complete copy
} NMEA_GNGGA_t;

const uint8_t NMEA_VTG_MAX_LENGTH = 100;

typedef struct
{
  uint8_t length; // The number of bytes in nmea
  uint8_t nmea[NMEA_VTG_MAX_LENGTH];
} NMEA_VTG_data_t;

typedef struct
{
  nmeaAutomaticFlags automaticFlags;
  NMEA_VTG_data_t workingCopy;  // Incoming data is added to the working copy
  NMEA_VTG_data_t completeCopy; // The working copy is copied into the complete copy when all data has been received and the checksum is valid
  void (*callbackPointerPtr)(NMEA_VTG_data_t *);
  NMEA_VTG_data_t *callbackCopy; // The callback gets its own preserved copy of the complete copy
} NMEA_GPVTG_t;

typedef struct
{
  nmeaAutomaticFlags automaticFlags;
  NMEA_VTG_data_t workingCopy;  // Incoming data is added to the working copy
  NMEA_VTG_data_t completeCopy; // The working copy is copied into the complete copy when all data has been received and the checksum is valid
  void (*callbackPointerPtr)(NMEA_VTG_data_t *);
  NMEA_VTG_data_t *callbackCopy; // The callback gets its own preserved copy of the complete copy
} NMEA_GNVTG_t;

const uint8_t NMEA_RMC_MAX_LENGTH = 100;

typedef struct
{
  uint8_t length; // The number of bytes in nmea
  uint8_t nmea[NMEA_RMC_MAX_LENGTH];
} NMEA_RMC_data_t;

typedef struct
{
  nmeaAutomaticFlags automaticFlags;
  NMEA_RMC_data_t workingCopy;  // Incoming data is added to the working copy
  NMEA_RMC_data_t completeCopy; // The working copy is copied into the complete copy when all data has been received and the checksum is valid
  void (*callbackPointerPtr)(NMEA_RMC_data_t *);
  NMEA_RMC_data_t *callbackCopy; // The callback gets its own preserved copy of the complete copy
} NMEA_GPRMC_t;

typedef struct
{
  nmeaAutomaticFlags automaticFlags;
  NMEA_RMC_data_t workingCopy;  // Incoming data is added to the working copy
  NMEA_RMC_data_t completeCopy; // The working copy is copied into the complete copy when all data has been received and the checksum is valid
  void (*callbackPointerPtr)(NMEA_RMC_data_t *);
  NMEA_RMC_data_t *callbackCopy; // The callback gets its own preserved copy of the complete copy
} NMEA_GNRMC_t;

const uint8_t NMEA_ZDA_MAX_LENGTH = 50;

typedef struct
{
  uint8_t length; // The number of bytes in nmea
  uint8_t nmea[NMEA_ZDA_MAX_LENGTH];
} NMEA_ZDA_data_t;

typedef struct
{
  nmeaAutomaticFlags automaticFlags;
  NMEA_ZDA_data_t workingCopy;  // Incoming data is added to the working copy
  NMEA_ZDA_data_t completeCopy; // The working copy is copied into the complete copy when all data has been received and the checksum is valid
  void (*callbackPointerPtr)(NMEA_ZDA_data_t *);
  NMEA_ZDA_data_t *callbackCopy; // The callback gets its own preserved copy of the complete copy
} NMEA_GPZDA_t;

typedef struct
{
  nmeaAutomaticFlags automaticFlags;
  NMEA_ZDA_data_t workingCopy;  // Incoming data is added to the working copy
  NMEA_ZDA_data_t completeCopy; // The working copy is copied into the complete copy when all data has been received and the checksum is valid
  void (*callbackPointerPtr)(NMEA_ZDA_data_t *);
  NMEA_ZDA_data_t *callbackCopy; // The callback gets its own preserved copy of the complete copy
} NMEA_GNZDA_t;

